
## Terraform plan for environment: `prod`

**Commit:** 40caade700a7a314ca84c328f19e94a88aa015ba


**API version:** 3b84b37b67
**CLI version:** 3b84b37b67
**Selfserve version:** d8c8b56bab
**Internal version:** d8c8b56bab

### Plan summary

`4 to add, 97 to change, 1 to destroy`

**🆕 Creates**

```tf
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
module.service.module.sns_batch_failure.aws_sns_topic_subscription.this["vol-app-prod-batch-failure-email-dvsa.tss-support+prod_olcs_jobs"]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["cache-clear"]
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-removal"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["tc-bus-registered"]
module.service.module.batch.aws_batch_job_definition.this["tc-bus-variation"]
module.service.module.batch.aws_batch_job_definition.this["tc-operator-licence"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-clean-up-variations-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-close-expired-windows-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-cns-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-company-profile-dlq-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-create-psv-licence-surrender-task-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-digital-continuation-reminders-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-duplicate-vehicle-removal-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-duplicate-vehicle-warning-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-enqueue-ch-compare-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-enqueue-ch-compare-1"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-expire-bus-registration-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-flag-urgent-tasks-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-inspection-request-email-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-interim-end-date-enforcement-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-international-goods-export-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-last-tm-letter-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-licence-status-rules-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-mark-expired-permits-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-company-profile-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-inbox-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-insolvency-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-insolvency-dlq-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-ntu-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-community-licences-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-disc-generation-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-disc-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-ecmt-accept-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-general-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-irhp-allocate-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-permit-generation-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-permit-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-psv-operator-list-export-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-remove-read-audit-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-resolve-payments-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-sas-mi-extract-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-tc-bus-registered-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-tc-bus-variation-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-tc-operator-licence-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-transxchange-consumer-0"]
```


----

<details data-gh-workflow="prod-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "2219362865935358745" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_api_image_tag"       = "release-v6.10.2" -> "3b84b37b67"
          ~ "deployed_cli_image_tag"       = "release-v6.10.2" -> "3b84b37b67"
          ~ "deployed_internal_image_tag"  = "release-v6.10.2" -> "d8c8b56bab"
          ~ "deployed_selfserve_image_tag" = "release-v6.10.2" -> "d8c8b56bab"
            # (1 unchanged element hidden)
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["cache-clear"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-cache-clear:1" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-cache-clear:1"
        name                       = "vol-app-prod-cache-clear"
      ~ revision                   = 1 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-cancel-unsubmitted-bilateral:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-cancel-unsubmitted-bilateral:9"
        name                       = "vol-app-prod-cancel-unsubmitted-bilateral"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-ch-vs-olcs-diffs:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-ch-vs-olcs-diffs:9"
        name                       = "vol-app-prod-ch-vs-olcs-diffs"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-clean-up-variations:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-clean-up-variations:9"
        name                       = "vol-app-prod-clean-up-variations"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-close-expired-windows:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-close-expired-windows:9"
        name                       = "vol-app-prod-close-expired-windows"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-cns:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-cns:9"
        name                       = "vol-app-prod-cns"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-company-profile-dlq:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-company-profile-dlq:9"
        name                       = "vol-app-prod-company-profile-dlq"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-create-psv-licence-surrender-task:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-create-psv-licence-surrender-task:9"
        name                       = "vol-app-prod-create-psv-licence-surrender-task"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-delete:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-delete:9"
        name                       = "vol-app-prod-data-retention-delete"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-populate:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-populate:9"
        name                       = "vol-app-prod-data-retention-populate"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-postcheck:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-postcheck:9"
        name                       = "vol-app-prod-data-retention-postcheck"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-precheck:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-precheck:9"
        name                       = "vol-app-prod-data-retention-precheck"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-database-maintenance:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-database-maintenance:9"
        name                       = "vol-app-prod-database-maintenance"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-digital-continuation-reminders:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-digital-continuation-reminders:9"
        name                       = "vol-app-prod-digital-continuation-reminders"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-removal"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-duplicate-vehicle-removal:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-duplicate-vehicle-removal:9"
        name                       = "vol-app-prod-duplicate-vehicle-removal"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-duplicate-vehicle-warning:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-duplicate-vehicle-warning:9"
        name                       = "vol-app-prod-duplicate-vehicle-warning"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-enqueue-ch-compare:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-enqueue-ch-compare:9"
        name                       = "vol-app-prod-enqueue-ch-compare"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-expire-bus-registration:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-expire-bus-registration:9"
        name                       = "vol-app-prod-expire-bus-registration"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-flag-urgent-tasks:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-flag-urgent-tasks:9"
        name                       = "vol-app-prod-flag-urgent-tasks"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-import-anondb:10" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.10.2"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "APP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prod.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.app.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prod.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "3b84b37b67"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prod.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-import-anondb:10"
        name                       = "vol-app-prod-import-anondb"
      ~ revision                   = 10 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-import-users-from-csv:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-import-users-from-csv:9"
        name                       = "vol-app-prod-import-users-from-csv"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-inspection-request-email:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-inspection-request-email:9"
        name                       = "vol-app-prod-inspection-request-email"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-interim-end-date-enforcement:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-interim-end-date-enforcement:9"
        name                       = "vol-app-prod-interim-end-date-enforcement"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-international-goods-export:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-international-goods-export:9"
        name                       = "vol-app-prod-international-goods-export"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-last-tm-letter:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-last-tm-letter:9"
        name                       = "vol-app-prod-last-tm-letter"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-licence-status-rules:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-licence-status-rules:9"
        name                       = "vol-app-prod-licence-status-rules"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-mark-expired-permits:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-mark-expired-permits:9"
        name                       = "vol-app-prod-mark-expired-permits"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-ni-compliance:10" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  ~ "/mnt/data/scripts/ni_dvacomplaince.sh" -> "/mnt/data/scripts/ni_dvacompliance.sh",
                ]
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.10.2"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "APP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prod.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.app.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prod.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "3b84b37b67"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prod.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-ni-compliance:10"
        name                       = "vol-app-prod-ni-compliance"
      ~ revision                   = 10 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-populate-anondb:10" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.10.2"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "APP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prod.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.app.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prod.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "3b84b37b67"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prod.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-populate-anondb:10"
        name                       = "vol-app-prod-populate-anondb"
      ~ revision                   = 10 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-cl"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-cl:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-cl:9"
        name                       = "vol-app-prod-process-cl"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-company-profile"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-company-profile:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-company-profile:9"
        name                       = "vol-app-prod-process-company-profile"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-inbox"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-inbox:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-inbox:9"
        name                       = "vol-app-prod-process-inbox"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-insolvency:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-insolvency:9"
        name                       = "vol-app-prod-process-insolvency"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-insolvency-dlq:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-insolvency-dlq:9"
        name                       = "vol-app-prod-process-insolvency-dlq"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-ntu"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-ntu:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.10.2" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "3b84b37b67"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.10.2" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:3b84b37b67"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-ntu:9"
        name                       = "vol-app-prod-process-ntu"
      ~ revision                 ... (truncated, see full plan in the workflow run logs)
```

</details>